{
  "backend/main.mo": "Main Motoko actor implementing the e-commerce backend with product catalog CRUD, user profiles, order submission/retrieval, and Stripe configuration, all protected by role-based access control (admin/user).",
  "feature_evidence.json": "Feature evidence report confirming that the PRODUCTS array in ProductCatalog.tsx has been populated with at least 40 unique tech/gadget products across multiple categories.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of every frontend source file, describing the purpose and key functionality of each component, hook, and style file.",
  "frontend/index.css": "Global CSS file that sets up Tailwind layers and defines OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, primary, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point for the Gadget Galaxy app, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that manages cart state, multi-view routing (catalog, checkout, order-success, order-history, payment-success, payment-failure), Stripe redirect detection, and wires together all major UI components within QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/components/CartPanel.tsx": "Slide-in cart drawer component displaying cart items with quantity controls, remove buttons, subtotal, and a checkout button, plus an empty-state view.",
  "frontend/src/components/CheckoutFlow.tsx": "Renders the checkout order summary page, handling authentication, Stripe-based payment redirect, and fallback direct order submission via backend mutations.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with brand info, quick navigation links, contact details, and a caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky top navigation bar with brand logo, nav links, cart icon with count, and Internet Identity login/logout controls.",
  "frontend/src/components/Hero.tsx": "Full-width hero section with a headline, tagline, and two CTA buttons linking to the products section.",
  "frontend/src/components/OrderHistory.tsx": "Displays the authenticated user's past orders fetched from the backend, with loading skeletons, error handling, and an empty state.",
  "frontend/src/components/OrderSuccess.tsx": "Success confirmation screen shown after an order is placed, displaying the order ID and buttons to view orders or continue shopping.",
  "frontend/src/components/PaymentFailure.tsx": "Error screen shown when a Stripe payment is cancelled, with options to retry checkout or return to shopping.",
  "frontend/src/components/PaymentSetup.tsx": "A React component that renders a floating button and dialog for configuring Stripe payment settings (secret key and allowed countries), with validation and save logic using custom query hooks.",
  "frontend/src/components/PaymentSuccess.tsx": "A presentational component that displays a payment success confirmation screen with options to view orders or continue shopping.",
  "frontend/src/components/ProductCatalog.tsx": "Defines the product data (PRODUCTS array) and types for a tech gadget store catalog, with a browsable, filterable product grid UI supporting search and category filters.",
  "frontend/src/components/UserProfileSetup.tsx": "A modal dialog that prompts newly authenticated users to enter their display name on first login, saving it via a backend mutation hook.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider for ICP, exposing login/logout functions, identity state, and login status to child components via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, orders, Stripe configuration, and checkout sessions via a backend actor.",
  "frontend/src/index.css": "Global stylesheet importing Inter font, Tailwind directives, and defining light/dark CSS custom properties for the teal-branded design system.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with teal brand colors in oklch, custom fonts, border radii, shadows, and accordion animations, plus typography/container-queries/animate plugins.",
  "project_state.json": "Project state metadata describing a tech/gadget e-commerce catalog app ('Gadget Galaxy') with one completed feature and one pending request to expand the product catalog."
}