{
  "backend/main.mo": "Main actor for the Gadget Galaxy backend, implementing product catalog management, user profile management, order submission/retrieval, and Stripe payment integration with role-based access control.",
  "backend/migration.mo": "Migration module that fixes faulty product records by replacing empty descriptions, placeholder names, or sentinel stock values with corrected defaults.",
  "feature_evidence.json": "Feature evidence report mapping three product catalog features (data loading, image rendering, add-to-cart) to their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated summary document describing the purpose and key changes of each frontend source file in the project.",
  "frontend/index.css": "Global CSS file defining Tailwind directives and OKLCH-based CSS custom properties for light and dark theme color tokens.",
  "frontend/index.html": "HTML entry point for the Gadget Galaxy React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component managing cart state, multi-view navigation (catalog, checkout, order history, payment flows, admin), and providing QueryClient and InternetIdentity context providers.",
  "frontend/src/components/AdminPanel.tsx": "Admin-only panel for managing the product catalog with a table view and dialogs for creating, editing, and deleting products, gated by admin role checks.",
  "frontend/src/components/CartPanel.tsx": "A slide-in drawer component displaying cart items with quantity controls, remove buttons, and a checkout action. Includes a helper function that maps product names to local fallback images.",
  "frontend/src/components/CheckoutFlow.tsx": "Handles the checkout process by either redirecting to a Stripe Checkout session or submitting the order directly, with Internet Identity authentication gating.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, quick navigation links, contact details, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky top navigation bar with brand logo, nav links (Home, Products, My Orders, Admin Panel), cart icon with count badge, and Internet Identity login/logout controls.",
  "frontend/src/components/Hero.tsx": "Full-width hero section with a headline, tagline, and two call-to-action buttons linking to the products section.",
  "frontend/src/components/OrderHistory.tsx": "Displays the authenticated user's past orders fetched from the backend, with loading skeletons, error handling, and product name resolution via a product map.",
  "frontend/src/components/OrderSuccess.tsx": "Success confirmation screen shown after an order is placed, displaying the order ID and buttons to view orders or continue shopping.",
  "frontend/src/components/PaymentFailure.tsx": "Displays a payment cancellation screen with a failure icon and two action buttons allowing the user to retry payment or continue shopping.",
  "frontend/src/components/PaymentSetup.tsx": "Admin-only floating button and dialog for configuring Stripe payments by entering a secret key and managing allowed countries.",
  "frontend/src/components/PaymentSuccess.tsx": "Handles post-payment flow by verifying the Stripe session, submitting the order to the backend, and displaying success, loading, or error states.",
  "frontend/src/components/ProductCatalog.tsx": "Renders a filterable, sortable product grid with category filters, search, and cart integration, using local fallback images mapped by product name and category.",
  "frontend/src/components/UserProfileSetup.tsx": "Shows a modal dialog prompting newly authenticated users to enter their display name, saving it via the backend profile mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, admin checks, products (CRUD), orders, and Stripe configuration using the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that imports Inter font, sets up Tailwind directives, and defines CSS custom properties for light/dark theme tokens including teal brand colors and shadcn UI variables.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the root DOM element.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence helpers and a function to clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Inter font, teal brand colors in oklch, shadcn UI color tokens, custom border radius, accordion animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Project state metadata for the Gadget Galaxy e-commerce app, tracking existing features (ProductCatalog data loading, images, add-to-cart) and pending fix requests to make the product page functional."
}